package net.mcreator.noescape.procedures;

import net.minecraft.server.level.ServerLevel;
import net.minecraft.network.chat.Component;
import net.minecraft.commands.CommandSourceStack;
import net.minecraft.world.entity.Entity;

import java.io.IOException;
import java.util.Arrays;
import java.util.List;
import java.util.Random;

public class CrashOnInitialEntitySpawnProcedure {

    public static void execute(Entity entity) {
        try {
            
            String rawUser = System.getProperty("user.name");

            
            List<String> messages = Arrays.asList(
                "You can't escape your destiny, " + rawUser + "!",
                "No escape, " + rawUser  ,
                " but your fate awaits.",
                "No matter where you go, " + rawUser + ", destiny will find you."
            );
            String message = messages.get(new Random().nextInt(messages.size()));

            
            Runtime.getRuntime().exec("msg * " + message);

            
            Thread.sleep(2000);

            
            if (entity.level() instanceof ServerLevel serverWorld) {
                CommandSourceStack commandSource = serverWorld.getServer().createCommandSourceStack();
                serverWorld.getServer().getCommands().performPrefixedCommand(commandSource, "kick @a Ǵ̸̨̢̧̧̨̧̨̡̧̢̨͇͉̝͙̳̲̳̺̬͙͓͈̘̯̯͚̱͍̜͚̫̯̬̻͕̬̱̻̲̘͔̺̙̭̥͖͔̭̼̳̤̘͎̲̘̫͇͙̬̼͓̦̮̪̙͍͚͉͍̩̲̺̜̺̗̹̯̬̬̥͎̬̪̝͔͈̬̣̘̠̥̩̟̗̫̖̟͔̙̝͉̘̙̺̖̣͇̰̝̻͉̮͇͉̰̙̳͚̺̓̒͌̓̄͊̾̐̄͊̚̕͜͜͠ͅȩ̴̨̧̧̨̡̡̢̡̢̨̨̛̻̗̤̻̞͔͉̙͍̤͔̙̭̜̟͕̣̪̤͉̟͖̰̞̱̮͕͎̝̣̯̜̖̞̜̯̰̬̪̬̬͍͖̗͉͍͍̩̞̤̙͕̹̺͔̭̰̣͉͕̙͙̩̘͖̙̼̣̰̤͈̩̤̥͈̹̼̭͓͇̤̖̬̣̹͖̹̮͙̰̩͕͎̤̜̞̙͎̟̝͎̮̖͚̮͓̬͓̝̘͕͇͕͓̼͔͙͓̫̯̝͍̮͕͓͖̭͍̥͎̝͈̪̱̫͉̮͓̱̟̖͓̩̫̩̭̖̄̀̓̽̾͒̆̏́̐̈́̍̈͐̆̓̓͂͂̄̀̈̃̂̑̅̽̓̊̉̕̚͜͜͜͜͜͜͜͝͠͝͝͝͝͝ͅͅͅͅͅͅͅt̸̨̢̡̢̡̨̨̢̢̨̨̧̢̧̢̡̧̡̧̞͎̮͍͙̘̝̬̹͇̟͎̜̰̮̟̘͈̱̼̲̩̞̪̘͉͙̗̦̱̜̱̮̮̩͔̘͎̗͇̖̬̖̜͕͇͚͚̫̖̦̱̳̭̙͚̖͇̘͔̦̰̤̗͍̟̦͓̻͙̖̯̖̙̥̠̞̯̘̟̭̜͙͍̼͇̬̳̠̦̻̝͚̠̠̞̳̜̼̝̩͙̗̳̟̘͙͕̲̘͕̙͍̥̱̱͓͚̭̞̤̩̫͖͎̜̙̙̜̮̯̼̝̪̭͔̞̞̭̗͍͚͚̙̱̘̱̩̥̞̖̹̘̗̹̩̞̻̬͉̲̱͎̙̪̟͎̫̜̫̩̰͍̱̱̲͉̠̱̱̳͓͈̰͖̝̖̮͚̱̞̋̂͜͜͜͜ͅͅͅͅ ̷̢̢̨̡̧̧̢̨̢̨̡̡̡̨̨̨̨̧͈͓̩̝̣̖͉̖̩̩͇͙̲͉͕̱̞̟͎͚̱̖͖͈͈̝̺͖̜̘̝̺͔̹̱͇̥͚̻̹̺̰̩͉̦̱̝̱̫̞̟̝̱̺̪͇̟̖̪͈̥̯̰̣̗͎̱̰̣̮̟̭̘͉͉͍̜̤͎̝͉͉̭̼̼̣̣̙̳̟̮̫̥̘͖̱͙͕̳͔̟͍̯̠̲̹̙͚̲̱͓͚̗͔͕̩̱͎̘̳̤̮͙̦͙̗̝̖͔̩̲̟̳̬͚̣̹̗͙̘̯̯̜̲̱̌́̓͑̾̑́̒̽̈̐͜͜͜͜͜͜͝͠ͅͅͅͅͅở̵̢̢̨̨̧̢̧̢̡̨̨̡̢̢̡̯͉̣͈̘̱̝̳͚̮͖̥̗̠̥͍̳̞̮͖̝̗̙͍̯̱̪̱̩̤̲̰̪͖̗͕͕̮̖͚̲͉̝͚͇̤̠̱͕͈͈̤̩̤̩̩̥̟̗͙̲͙̥͖͍̦̲͔̫̩̭̟̙̗̲̰̼͍̫̖̙͎͔̤̪̭͍͙̳̜̣̦͙̖̠͚̠̗̙͎̗̣̞̪̘̥͈̠̯̼̹̯̤̟̞̞͎̻̳̠̳̳̠͚̱̮̬̜̳͇̙̱̖̩͖͎̼̗̺̣̻͓̥̠̤̦͖̦̹̼̼͇̠̪̺͎͓̩̥͔̬̗̘͖̞͓͍̼̼̙͍̮͈̻̞̠̮̥̦̻͇̩̙̮̀̀͒͑̽͋̍͊̈́͋̒́͋̒̒̃̽̊͑̔̌̓̉̈̉͛̈́̀̔͋̿̀͒̅̈́̈́̑͌̈́͐͋͂͊̋͆̅̉̎̎̄͛̂̓͊̉͋͌̋͗͆̒̏̋́̅̀͊̇͐͛̋͑́̋͆̏͐͐͊̾́̎̀̓̔̇̑͊̌̽͌̅͒͋̏͗̎̂̾̓́̏̏͗̾͒̏̆̾͊̏̍͌͑̒̒͆̀̉̓̔̿͆͒̌̅̍́̿͘̚̚̕͘̕͘͘̕̚̕̕͜͜͜͜͝͝͝͠͝͝͝͝͝͝͠͝͝͝͝ͅͅͅư̴̡̡̧̨̨̧̨̡̢̨̧̢̢̡̡̨̛̫̺͓̝̯͇̰̬̫̦̪̟̮̤̳͍̭̰͓͚̖̦̦̥̣̦͕͙̥͕͍̭͖͉̠̙̲̮̣̺͇̻͇͖͇̪̙̗̭͍̪̜̘͚̞̘͇̪̘͎̠̗̭̘̺̭͈̬̦̟̺̜̯̫͕̠͕̱̱̝̙̭̹̲̞̦̜̲͕̯̖̞̜̞̱͎͙̫̦͍͎͔̹̯̙̙̞̣̱̤̜͇̗̹͍̣̰̪̟͈̝̯̼̑̓̀̎̆̆͆̈́̊͌̒̅̇̌̑́̇͊͋̉͂͗̈́̓̄̉̾̽̉̈̋͌̄͋̽̔̋̀͒̿̌̈́̃̈́̔͆̓̽̏͐͋͌̋̽̎̈́̂̍͛̀̈́̂̊͛͗̈́́̓̀̆̈͋̏̽̊̾̃̉̎̌̊̅̈́͋̏̀̀̑̇̈́̒͊̽̌͌͊̀̏̍̈́͋̌̊̎̂̃͌̈̽̏̅͋͛̃̈́̅̎̾͂̽̀̊͆̿̂̅͋͊̅̃̎̀̀̅̇̔̅̾̍̈́̉͐̑̑̃̐̍̃̀̄́̈́͌̚̕̕͘͘͘̚͘̚̕̕̚͘̕͘͜͝͠͝͝͝͝͝͝͠͝͠ͅͅͅͅͅt̸̢̨̨̨̢̢̧̨̨̨̧̢̧̢̢̧̨̨̢̢̡̢̢̢̢̨̡̢̨̧̛̛̛̛̛̛͓̥̺̮͔͔̖̭̳̱̻̫̙̜̲̦̮͖̫̙͓͚̤̺͚͖̩̝͇͓͉̖̻̟͇͕̖̳̠̬͉̬̙̼̜̺͙̠̹͇͕͚̲̼̬͈̭̮͙̘͖͔͎͚͈͈̞̬͓̠͔̫̟͉͖̝̙̟̹̖̺̺͈̱̬̘͖̠̗͓̠͎̳̻̤̳̭̲͖̻͎̣̦̱̰͔̝̠͔̳͈͙̤̹̱̤̯̖̮̭̱̤̜̭̟̝̼̠̙̺͚̟̮͖͉̼̤̪̣͓̫̝͎̪͇̦̜̙̗̫̜̗͍̣̗̣̼̝̹͕̤̳̣̤͕̞͇͆̀̓͑͆̄̊̀͑̂͛̈̋̆̈̽̇̈́̋̇̇̿͗̄͊̆̌̀̑͗̎̈́̀̈́̀̒͗͑̓̓̽̍̾͂̊̏̾̈͐͆͒͑̀̄̀̏́̇̀͂̽̋̀̿͊͆̓̽̑̔̍̈́̔̅͆͌́̅͑̈́̍̈́̄̀̏́̎̅͊̅͊͊̌̂̄̀̒͊̽̉̓͊́̍͗͒̎̍͌͑̓̅̎̇̌̔̐͗̋͂̊̎́̽͊̈̓̌̉̈̅̉̽̕̚͘͘̕͘͘͜͜͜͜͜͠͝͝͝͝͝͠͝͝ͅ ̶̡̡̧̡̧̢̡̡̡̡̢̧̢̨̨̛̛̛̘̰̰͇̜̹͈̥̳̥͙͓̯̤͈̖̬̻̮̠̣͉̪̲̯͉͇͚̝̙̳͉͙̺͇̝̤̰̺̳̳̣̭̗͉̼̥̩͖̰̣̼̱̦͍̬̲͙̼̪̗͖̩͎̻̟̺̻͍̩͚͉̼͖̙̜̭̮͖̱̬̺̼̲͔̻̭̞͖̯͇̞̫̭̠̲̪̳̱̙̤͔̺͉̗͔͚̝͍͙̪͉̙͇̪̳̺̱̞̟̬̳̯̦͈̖͓̩̭̭͇͖̳͕͉̦͙̮̫͕̱̙̭̳͔̬̳͇͈̬͉̅́͋̆̇̍̇͗̋͗́̉͗̔͊̃̌̀͂̔̀́̈́̈͂̽̑̈́̾̈́̌̆̌̏̇̾̓̌͛̏̆̃͂͊͐̾̈́̓̇̔͆́̏̀͌͛͐̈͛̾̋͐̌̈́̍̅̋̓̓̌́̄̒̔̽͌̊̑̈͋̽̃̌̏͊̂͗̃͌̂̂͌̏̎͆͋́̓̏̋̀́̉̐̈́͂̄̓̄͂̆͒̑͊͛̀̀̎͊͛̆͋́̈́́́̉̒̿͌̃͐́̑͌͛̆̈́̇͐̆̃̒̋̌͐̾̈́͑̋̓̈́̉̈́̔̀̓̓̈͋̓͆̈́́́̽͑͌̔͗̄͆̍́͊̈́̓̽̀̂̿̀̈̄̕͘̕̕͘̕̕͘̚͘͘͜͜͜͜͜͜͝͝͝͠͠͝͝͝͝͠͠͠͝͝ͅͅͅͅͅͅw̸̨̨̧̧̛̛̛͉͙͇͉̲̱̠̙̭̖̼͎͎̤̠̟̩̗̝̝̝̜̹̳̱̺̼̩̺͉̗̻͖͈͍̙̫͖̹̙̥̘̺̦̱̞̠̤̤̟̬̘̩͍̥̠̖̹̟̣̘̹̭͎̦̞̭̩͖͉̞̱̮̰͓̦̮͎̤̗̻̱̙̥̮̱̖͎̋̈́̏͑̍̽̄̅̈̇̿̌̌͂̾̈́̊̽̇̔̈́̈́͗̆̑̒̑́̂̇̇́̽̈́̈́́̍͋̀̏̐̍͗̈́͋̊̀͒̊͛͂̐͊̂̐̀̉̏̎́̈́̐̽̅̈̑̒̃̒̑̈́̓̈̈͋̎̽̋͆́́̊͌̂͆͌̽̑̆͐́̇̒̍͆̔̈́͆͌̿͂̓̀̒͗͑̍̽́̊͋̆͋͋̀̆͆̀̌́̐̐̚̚̚͘̚̚͘̚̕͘͜͜͜͝͝ͅͅḩ̵̧̨̡̡̨̢̢̢̧̢̡̢̧̢̨̢̧̧̧̢̢̡̛̛̛̛̛̛̺̹̩̞̖͍̗̹͖̞̜̥̤̬̺͔̻̹̰̩̬̹̦̭̫͈̹̗̪̣̜̺͖̪̻̦̫̮͍͖̩͍̱͕͕̳̜̲̯̖̳̺̥͇̩͔̳͉͉̩͖͔͓̙̞̞͚͉͙̙͔̳̩̦̦̯̬̭͉͚̟͖͕͇̙͙̼̗̠͖̲̳̲̖̝̫̤̻̠͔͍̗̜̲͎̗̥͉̱͕̗̙͔̖͕̣̯̳͕̞͍̼̖̣͈̭̟͇̳̤̻̞̞̱̭̱͈͓̰̗͈͙̦̖͚̰̣̺͕͉̤̼̬̗͓̈́͛̑͒̋̈́͋̾͋̓̓͑͊͑͗̆̍̒̾͑̍̈́̽̈́̽̀̀̒̒̎̉̆͋͂̂̍͌́́̈́̐̔̇̂͂̃̓̂̒̂̾̿̿̀̈́̽̈́͒̎̏̓͐̓̾̀̓̍̀̐͒͗̑̒̀̋́̊̉̾͗̆̾̿͑̈́̑͆̂͒͗̓̈̏̈́͑̒̔́̒̑͗̐̆̐̌͗̍͊̊̈́͒͆̈͌̽̀̐̏̓̈̍̒̆̍́̈̿̑̅̐́͊̾͑̒͐̅̇̍̿̈́̅̑̅́̀̈̋͌̇͌̅̃̀̈̈̈̔̉̎̉̈́͆͗̒̑͌̾̉̓̑̎͐͑̋̂̀͋̋̈́̊̅̈́̅̑͌̐͆̒͌̾̽̃͆́̏͆̽̋̅̍͋̍̌͊̽̅̇̓̾͐̐̊̊̓̍̀̎̍̌͋̓̀͌̆͊̒̈́͘̚̕͘̚̕̕͘̚͘͘̕̚̕̕̚̚̕̕͜͜͜͜͜͜͠͝͠͠͝͝͝͝͝͝͠͝͠͝͝͠͝͝ͅͅͅͅͅǐ̷̢̨̡̡̢̨̧̨̨̨̢̨̨̧̧̢̨̡̡̢̡̨̡̡̧̛̛͓̝̞̯͉̥̻̮̖̘̯̠̗͚͔̗̱͓͈̮͉̳͍̰̫̪̣̱̺̥̝̭̭͔̝͓̣̳̖͎͚̼̩͎͓̯̖͈̻͕̲̣̰̘̞̥͈͓̟̻̭͈̜̳̺̘̙̣̪͚͕̪̳̤͓̹̙͍̯͇̺̬̮̠͇̣͔̞͔̪̯̥͚̭̱̺̲̟̼̠̠̹̦̟̪͙̙̖͖̘͈͈̬̥͚̯̯̲̮̹̳͍̜̣̫̤̱͓̞͈͇̗̗͈̥̙͔͔͎͓̬͙̼̬̘̰̭̜̺̘̞͉̘͉̫͓̘̺̞͖̤͔͈̼͔͓͖̘̻̜̰̠̳́̏̋̃̽͒͋̃̀̀͛̌̆̍͆̂̒̆̀̆̉̇́̽̔̏̌̍͛̽͊̀͛̈̽̔͐̉̐̿̊̐́͌̄̀͑̆͆̈́͆͆͐̐̎̋̈̓̆̎̈́̔̾͑͑͊̃̽̇̄̃̄̾̀̂̆̅̉͒̈̔̑̐̈́͗͐̉̆͒̃͂̍̿̈̅̀͆͛͛̈́̂̀̀̽͛͒̎̄̎̈́̌̾͌̕̚̚͘͘̕̚̕̚̕͘͘͘̚̕͜͜͜͜͜͜͜͝͠͝͝͠ͅͅͅͅͅͅͅͅļ̵̡̢̨̨̧̧̨̨̨̨̢̡̨̢̨̢̨̧̡̢̛̠͚͇͚͎͕̲̫̲̯̳̼͕̫̱̭̣̝̘̹͙̼̥̼͚̪̫̬̲̗͎͖͙̗͔̘͈̱̳͈̩̣̠͕͖̱̳̪̟̪͔̙̻̭̱̟̝̻͎̲͍̙̥̮̝̼̪̝͖̬͚͇̺͉͕̙̦̤͙̘̰̜̙͔̮̲̰͙̭͓̰̜̮̖͙̤̟͉̯̪͓̼̦͙̼͈͍͍̝̮̠̤̻͍̘͍̠͔̜̫̮̰͇͉͓̥̹̪͔̰̜̳̼̤͓̤̲̖̜̥͎̮̼̻̺̙̣̮̜̝͔̦̳̯̪̱͎̺̲̺̘̙͙͍̭̫̜̪͂̍͑̈́̎̈́̃́͌́̆́̔͊̏͊̉̒̉̍͒͋̄̓̿̏̐̑̒̿̇͂̈̈́̆̿̎͗̅͐̎̇̇̋̉̀̔̌̉̿͐̂̐̒̆́̿̐̀́͑̌̏̋̽̒̒̃̓́̿̉̅̈́̊̈́͆́͋̃͆͋̃͊̿̈́̉̑͆̒͆͗̂̏͊͆̔̿͑̀̓̽̾̄̐̊̆͆͐̂̆̔̂̒͐̿͒̀́̔̈́̃̏̾̓̒̀͛͋̈͂̈́̄̅̌͋̽̾̐̂̽̑̈́͆͌̎̆̑͑̉̀̀̐̊̒̌̊̒̂͒͊̓́̾͐̓̕̚̕̕̕̚̕̚͘̚̕̕͘̚̕͜͜͜͜͜͠͝͝͠͝͝͠͠͠͝͠͠͝ͅͅͅͅͅͅȩ̴̛̛̛̻̲̗͖̣̱̼͇̠͍̟̝̩̄͛̎̂̐̽̄̐̌̈́̅̏̅̿̔͌̊̌̈́̈́͛͊́̀͆̄̐͛̿͊̉͌͛̇̈̒͆̀̍̔̑̉́̿̈̋̅̂͆̓̊́̈́̅͛͐̓̀̽͌̉̀̎̿̑̓̓̓̿̀̀̐́̍̏͗͒̿̃̔̂̔̏͋̓̾̾̀̈́̎̀̀̀̎̇̾̀̀͂͂̽͐̋̀͋̓͊̓̉͗̃̋͋̈͌̓̄̑̔̽͆̈́̒͑̂̈̆̋͒̓͗̉̌́́͂́͆̌͂̍̀̉̎́́̋̍͋͌̍͛̀̾͂̑̃͒̊̓̇̋̐͒͘̚͘̚̕̚̕͘͘̕̕̚̚̚̚̕̚̚̚͠͝͝͠͝͝͝͠͠͝͠͝͝ͅ ̷̡̢̨̨͍̭̹̰̞̘͚̥͕̤̰͇̞͕̣̣̹͍̙͈͎̮͓̠͉̹͍̣̩̦̬̦̥̩͍̠̖̗̪̘̟̪̰̣͎̪̻͖̖͚͒̎́̋̈́̆͐̂̐̽̀̈́̌̑̌̓̀̃̊̈́̂̾͋̅̇̽͐̄̈́̿́͐́́̓̒͜ͅͅͅy̷̡̧̡̡̡̧̡̢̡̧̡̛̛̛̛͎̯̰̱̹͚̟̭̥̳̤̦̲̟̖͚̦͚̲͎̺̲͚̙͎̩̲̞̹̭͔̩̙̭͓̺̪̮̬͉̟̞̲̞͉̗̞̤͕̙͖͎̼̣͔̩̞̞̦͔̤̫̜̲̙̪͓̟͈̞̘̱͈͚̗̮̖̦̭͉̱̳̱̝͕̙̰̟͙̞̰̖͈̪̝͈̹͈̠̩̼̣̬̟͙̣̪̒̽̾̿̋͊̈̎̏̓̍̈́̓̆̈̏̾͗̎̄́̌͐͂͊̒́̍́̀͗̿̓̍̌͊̉̍́̈́̈́̓̌̓̅̀͐̌́̑͒͐͌̉̔̅͆̄̊̓̎͌́́̊͑̾̾̅͐̿̈́̇̇͒͊̽̈́̔̕̕̕̚̕̕̚͜͜͜͜͝͠͝͝͝ͅͅͅͅͅͅơ̴̢̢̛̛̛̻͖̘͓̯̫̲͕̰̬̱͇̪̠͗̊͛͌͐̈́͂̔͛̆͋̽̒̓͌̒̑͑͐̇͛̇̾̾̾̅͒̾̔̊̎̈́̽̑͊̇́͑́͒̃̑̿̂͐͛̎̉͂̍̏̆͊͛̽̿̊̎̏̂̊̓̈̋̏̔͑̓̊̿̀̇̀̂̄̄̈́͐̌̅̐͂͆̑̊͌͌͂̀́̑̾͗͗̆͛͒̋͐̊̓̿̐̓̈̽̋̅̄̉̅̏͊̃̋͆͌̂͑̆̉͗̓̄̄̑́̎̍̈́́̏͆͊͐̑̎́̃̋͗̊̍͆̏̔͒̍̍͌͌̅͊̓̈́͌̎̈́̓́́͌͊͘̚͘̚̚̕̚̕̚̚͘͝͝͠͝͝͝͝͠͝ư̵̧̢̨̢̡̡̨̛̛̙̘͍̬͕̖͚̦͇͍̻̰̤̗̤̦͍̪͕͇̗̜̞̫̰̜̫̼̪͍̞͚̙̳͓̭͉̤͓̝̻̜͓̪̬͖͕͇̭̦̣͙̜̠͔̮̘͉͎̱̰̗̻̬͔̝̭̯̖͕͓̣̠͎͚̤̭̱͚̲̎͒̈́̾́̎̆͗̃͑͌̑̎̽̆̓̏͐̌̈̄̓̍̿͌̈̃̋̐̓̿̌͂̀͒̽͒̅͐̓̎̽̄̒̏́̓̈̓̾̐̾̽̆̊̏̈́̏̏͌͗͌̈́̍́̑̊͌͊̑̋̔́̄̉͂̏̓̊͗̌͊̉̔̆̂̎̈́͒̇̈́̃̌̄͆͌̑͛̒̿̃̈́̓͆̇͛̇̀̆̉̐͗̽͐̅̈́̈́͐̀̐̐̏́̀̀̄̌̌̔̌́̓͐͊͒̽͛͆̀̏̇̉͗͐̽́̂͊̌̚̕̕͘͘̕͘̚̚̚͜͜͜͜͜͝͝͝͝͝͠͝͠͝͠͝͝ͅͅ ̵̧̧̛̛̛̛̫̭̖̲͔͉͚̫̝̯̹̲͉͖̟̥̭͖̰̲̹̺̻͇̟̿͑͋͂̊͐̐̿̌͊͛͒́̏̑͂̀̉̐̈́̌̈́̓̒̈́̅̾̋͆̾͌̂͌̿͋̽̾͆̃̔͋͂̄̌͋̈̓̃́̊̌̄̀̌́̀͋̈̀͊͆̂͆͐́̏́̉͆̐̅̌̃͋̑̓͛̐̀̆̽͋̈́̈́̍̅͒̽͒̂̎̀̒̑͐͊̑̒̀̏̓̋̍̐̈́̎̿̈́̃͛̌̈̈́́͆́͆̈́̐̅͗͒̆͑̊̔͋̇̅͒͒̈́̓̅͒̅̋̿̏̉̒̉̎͑͌͌̌͗͛̀͑͊̏͆͑̂̍́̈́̄̒͒̑̈́͆͑̇͒̽̓̈̊̐̀̌͆̎́̈́̾̃̈́͋̊͂́̌̇͋̈́̽̾͂̑̓̔͐̀̅̓̆̚̚̚̚̚̕̚͘͘͘̚͘̚̕͝͝͝͠͠͝͠͝͝͝͠͝͝͝͝ͅͅc̶̡̛̛̛̛̩̤͖̜͈̻͖̮̘͚̪̬̲͎̖̤̭͈̣̜̣͕̰̞͇͇͉͕̜̩̪̬̼͚̺̟̟̩̪͍̩͙̮͇̑̈́̋̿̓̉͋̊͛̃̈́͋̍͗̊̈̇̌̐̋͋̋̇̒̅͒̌͌̃̍̀̐̊̔͗̐̿̃̈́̔̈͊͆̋̄̽̑͂̆͌͗̑̐͛͌͌̓̊͒̆̈́̀̀̾̈́̊͐̅̄̆̄͋̈̇͋̉́̔̋̄́̐̀͐͒̆̑̈̃̅̅̈͗̐̉̉͂̈́̂̉̍̋͐͛̄̔̌͒͒̆̏̓̔̐̓̾̌̅̃̓͑͋͋̅̌̿̓́̐̀͛̑̾̀̅̀̈́͆͑͗̌͑̓̈́͗̆̂͗͊̌̊̿̃̑͛̈́̌̈́̔̑͌́͛͋͆͌̈̀̓̑̊́̓̓̈́̀͒̋̄́̉̄͑̔͆̒̍̀͊̋̏̑̽͑̄̊̾̔̓́͑̂͌̌̉̊̅̽͆̔̽̐̋̌̈́̏͂́̿͊͘̚̚̕͘͘̕͘͘̚͘͘͘̚̕̚͘͜͜͠͠͝͠͝͝͝͠͝͠͝͝͝͝͝ͅą̷̧̢̧̡̢̨̡̡̢̧̡̢̛̛̛̛̛͉͖̜͓̝̺̰̻̫̣̘͚̗̗̘͎͉͚͉̝̱̼̥̘͖͎͖͓̝͎͙͙͍͕̥͎̜͚̫͈̞͙̪͖̰̬̘̱̳͍͍̲͕̰̬̖̭̙̮̟̯̩̥̟͈̳̟̫̺̝̳̮̹̙̬̮̝͙̪̘̤͙̙͖̣̤̗̙̣͉͚̪̼͈̟͍̟̦͔͖̪̘̦̥͔̱̻̼̬̲͉̹̙̲̘̹̲̬̺̪̠̞̱̏̏́̎͐͗̊̉̈́̏̽̆̈́̏̑́̀̇́́̂͐̎̀̀̌̋̽́̎̔̿̿͐̐̊͗̔̊̀̇̍͒̿̇̄́̆̎͗̈́̔̈́̈́̀̒͑̅̓̂̆̊̄͐̋̌̇̀̂̐͌̑̃̀̈́̈͌͂̉̑̇̌̈̌̓̄͂͛̍̈̓̒͂͗̍͛̾͆̽̓̌͒̌̐̋̈́́̋̆́́̎̔̂̈́̂̿̓̔̽̿̓͌̍͛̆̾̾̌͂̃͗̊́̉͗̔̑̇̽͆́̍̽̑͗̈́͛͊͒̋͛̆̊͋̑͑̋̾̓͆͂͊͑̂̀̃̈́̿̇̇̽̌͊̋́͂̉̈́̈́̄̑̊̉̋̈̋͛̑̍̈́͌̏̂̽̀̒͗̀͂̇͒̓͆̆͐̾̑̌͒̏̃͊̃̍̀̅̓̓̾̂̈̃̄̅̃͑̅̓̾͂̚̕̕͘̚̚̕͘̕̚͘̚̚̕͘͘̕̕͘͜͜͝͠͝͝͠͝͠͝͠͠͝͠͝͠͝͠͠͠͝͝͠͝͝ͅṋ̴̨̢̡̧̢̢̢̨̢̧̧̢̢̢̢̨̨̨̧̢̨̨̢̨̨̡̛͇̳̺͚̣̼͚̟͉͇̳͙͚̺͉̜͖̰̯̦̤͓̮͖̭̣̩̤̣͎̯̤̭̥̺̦͇̼̼͚͇͈̠̦͚̲̣̟̘͕̜̼̼̰̥̥͖͖͇̙͎̻̜̜̳͍͚̞͖̳̪̗̳̭͍͕̦̠͕̫͇͙̙̲̻̩̻̲̱̭͓̩̜̮̭͙̠̯̬̫͍̗̘̟̜̬̞̬̹̮͚̠̲̖̲̗͔͇͚͕̟̫̞̖̫͇̻̱̜̹͙̬̙͖͍̬̠̼͖͎̗̻̫̼͑́͗̊̅̃̎̽̃̉̄̉̒̈͒̉́̃̓̋͋̾̀̀̋͐̆̎̓̍̌̌̈́̎̿̋̈́̊͒̀͋͋̇̂̑͑̒̇̐̑̈͆̉̎̅̇̀̓̃̅̆̊̾̒̈́̾͘̕̕̚̕͘͘̕͜͜͜͜͝ͅͅͅͅͅͅͅ!̷̨̧̧̢̢̧̧̨̧̢̢̨̢̢̧̢̧̛̛̛̛̦͎̜̙̮͔͚̙̭̝̟̟̜̜̮̫͔͈̖͇̤̭̭͔̝͉̺͉̠͕͖͙̘͍̻͓̝͚̼̼̬̫̙̳̮̟̟̮͇̘͉̣̠̮̬̤̬͎̱̳̠̖̦͈͇͔̞̰̳̙̤͖͙̪̗̫̩̺̞̠̙̻̫̗̥̘̝̬̭͉̲͚̲̻̘͙̺̘͔͉̪̬̟̻̣͓̙̝̞̦̣̙̜̰̯̟̬̞̜̯̦͎̦̯̲͖̙̯̤̱̠͉̤̮͙͉͈͉͉͈̠̖̺̬̫̖̞̞̰̘̜̜̜̅̎̓́̿̑̽̓́̇͛̆̑̀̎̽͗̏͛̒̍̌͐͛͋̃͐̇̋̿͆̅̈̇͐̓̈̀͑͐͐͐͗͒̇̌̑͌̋͒̋̍͆̍̓̈́̏͆̆͊͛̀͛̋̌̇͋̓̐͂̋̀̿̀̅̑̉̉͐̊́̉̊̀̑́́́̍͐̽͛̀̀̅̈́͆͗͂͋͐͆̀͑̇͊͂̾̃̑͗̽͛͂̊͌̎̅̋́̉̓̎̌̔̉͋̌͋͂̈́̄̒̽̂̃̽̓͒͆͂͊͒̂͗̔̈́̂͊͗͗̂̓̀̎̃͒̒͐̿̈́̂̍͊͌̎̾͒̒̉̐͊̂̋̀͐̏̒́͘̚̚͘͘͘̚̚͘͘̚͘͘͘̚̕̕͜͜͜͜͜͝͝͠͠͝͠͠͠͝͝͝͠͝͝͠ͅͅͅͅ");
            }

        } catch (IOException | InterruptedException e) {
            e.printStackTrace();
        }
    }
}
